src/cf/MainBase/Documents/otus_ПисьмоПретензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>otus_ПисьмоПретензии</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АктПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.otus_АктПередачиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/MainBase/InformationRegisters/otus_СписокПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>otus_СписокПисем</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусОтправки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.otus_ПисьмоПретензии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/MainBase/Enums/otus_СтатусОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>otus_СтатусОтправки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/MainBase/Enums/otus_СтатусАкта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>otus_СтатусАкта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВозвращено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/MainBase/Documents/otus_ПисьмоПретензии/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	НаборЗаписей = РегистрыСведений.otus_СписокПисем.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	
	НовЗапись = НаборЗаписей.Добавить();
	
	НовЗапись.Письмо = ЭтотОбъект.Ссылка;
	НовЗапись.Период  = ТекущаяДата();
	НовЗапись.Ответственный = ПараметрыСеанса.ТекущийПользователь; 
	НовЗапись.Статус = Перечисления.otus_СтатусОтправки.КОтправке;
	НаборЗаписей.Записать(Истина);
	
	Акт = ЭтотОбъект.АктПередачи.ПолучитьОбъект();
	
	Акт.Статус = Перечисления.otus_СтатусАкта.НеВозвращено;
	
	Акт.Записать(РежимЗаписиДокумента.Запись);
	
	НовЗапись.Контрагент = Акт.Контрагент;
	
	НаборЗаписей.Записать(Истина);
КонецПроцедуры
